my99cats/app/controllers/cats_controller.rb

    def index
        @cats = Cat.all.order("cats.id ASC")
---
SELECT "cats".* FROM "cats" ORDER BY cats.name ASC

    def update
        @cat = Cat.find_by(id: params[:id])

        if @cat.update(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "cats" SET "sex" = $1, "description" = $2, "updated_at" = $3 WHERE "cats"."id" = $4  [["sex", "M"], ["description", "Loves lasagna  "], ["updated_at", "2020-08-14 20:44:18.615500"], ["id", 2]]